src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ВладелецФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияДатаМодификацииФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущаяВерсияНомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентХранилища</name>
    <type>
      <types>CatalogRef.КлиентыХранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/РаботаСФайламиИнтеграция/Module.bsl
////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область Служебные

Процедура ДобавитьОшибку(СтруктураОтвета, ОписаниеОшибки, Отказ = Неопределено)
	
	Если Не Отказ = Неопределено Тогда
		СтруктураОтвета.Вставить("Отказ", Отказ);
	КонецЕсли; // Если Не Отказ = Неопределено Тогда
	
	Если Не СтруктураОтвета.Свойство("Error") Тогда
		СтруктураОтвета.Вставить("Error", Новый Массив);
	КонецЕсли; // Если Не СтруктураОтвета.Свойство("Error") Тогда
	
	СтруктураОтвета.Error.Добавить(ОписаниеОшибки);
	
КонецПроцедуры // ДобавитьОшибку

Функция ПрочитатьСтрокуJSON(СтрокаJSON)

	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON)
	
КонецФункции // ПрочитатьСтрокуJSON

Функция СохранитьВременныйФайл(ДвоичныеДанные, РасширениеФайла, Структураответ)
	
	Результат = ПолучитьИмяВременногоФайла(РасширениеФайла);
	
	Попытка 
		ДвоичныеДанные.Записать(Результат);
	Исключение
		Результат = Неопределено;
		ДобавитьОшибку(Структураответ, "Не удалось сохранить временный файл", Истина);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // СохранитьВременныйФайл

Функция СеарилизоватьДвоичныеДанные(ДвоичныеДанные, СтруктураОтвет)

	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("BinaryData", ДвоичныеДанные);
	
	Попытка
		СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
		Результат = ЗаписьJSON.Закрыть();
	Исключение
		ДобавитьОшибку(СтруктураОтвет, "Не удалось сеарилизовать ответ", Истина);
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // СеарилизоватьДвоичныеДанные

Функция ДесериализоватьДвоичныеДанные(ДанныеСтрокой, СтруктураОтвет)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ДанныеСтрокой);
	
	Попытка
		Результат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("Структура"));
	Исключение
		Результат = Неопределено;
		ДобавитьОшибку(Результат, "Не удалось прочитать данные файла", Истина);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ДесериализоватьДвоичныеДанные

 #КонецОбласти

#Область РаботаСФайлами

Функция ОбработатьПолученныйФайл(СтруктураПараметров, КлиентХранилища, ПутьКФайлу, СтруктураОтвет)
	
	Результат = Истина;
	
	ФайлХранилища = Справочники.Файлы.НайтиФайл(СтруктураПараметров.FileID, КлиентХранилища);
	Если ЗначениеЗаполнено(ФайлХранилища) Тогда
		
		Если Не ОбновитьДанныеФайла(ПутьКФайлу, ФайлХранилища, СтруктураОтвет) Тогда
			Результат = Ложь;
		КонецЕсли; // Если Не ОбновитьДанныеФайла(ПутьКФайлу, ФайлХранилища) Тогда
	
	Иначе
		
		Если Не ДобавитьФайл(КлиентХранилища, ПутьКФайлу, СтруктураПараметров.FileID, СтруктураОтвет) Тогда
			Результат = Ложь;
		КонецЕсли; // Если Не ДобавитьФайл() Тогда

	КонецЕсли; // Если ЗначениеЗаполнено(ФайлХранилища) Тогда
	
	Возврат Результат;
	
КонецФункции // ОбработатьПолученныйФайл

Функция ОбновитьДанныеФайла(ПутьКФайлу, ФайлХранилища, СтруктураОтвет)

	Результат = Истина;
	ПотокВПамяти = Новый ПотокВПамяти;
	ПустыеДанные = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();

	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);

	ИнформацияОФайле = Новый Структура;
	ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", ПоместитьВоВременноеХранилище(ДвоичныеДанные));
	ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", ПоместитьВоВременноеХранилище(ПустыеДанные));
	
	Попытка
		РаботаСФайлами.ОбновитьФайл(ФайлХранилища, ИнформацияОФайле);
	Исключение
		ДобавитьОшибку(СтруктураОтвет, "Не удалось обновить файл", Истина);
		Результат = Ложь;	
	КонецПопытки;
	
	Возврат Результат;

КонецФункции // ОбновитьДанныеФайла

Функция ДобавитьФайл(КлиентХранилища, ПутьКФайлу, FileID, СтруктураОтвет)

	Результат = Истина;

	Файл = РаботаСФайлами.ДобавитьФайлСДиска(КлиентХранилища, ПутьКФайлу, FileID, КлиентХранилища);
	Если Файл = Неопределено Тогда
		ДобавитьОшибку(СтруктураОтвет, "Не удалось поместить файл в хранилище", Истина);
		Результат = Ложь;
	КонецЕсли; // Если Не Файл = Неопределено Тогда
		
	Возврат Результат;

КонецФункции // ДобавитьФайл

Процедура УдалитьВременныйФайл(ПутьКФайлу, СтруктураОтвет)
	Попытка
		УдалитьФайлы(ПутьКФайлу);
	Исключение
		ДобавитьОшибку(СтруктураОтвет, "Временные файлы не удалены");
	КонецПопытки;
КонецПроцедуры // УдалитьВременныйФайл

#КонецОбласти

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция GetFile(СтруктураПараметров) Экспорт
	
	Результат = Новый Структура("Отказ", Ложь);
	
	// Обязательные параметры
	Если Не СтруктураПараметров.Свойство("FileID") Тогда
		ДобавитьОшибку(Результат, "Не указан параметр запроса [FileID]", Истина);
		Возврат Результат;
	КонецЕсли; // Если Не СтруктураПараметров.Свойство("FileID") Тогда	

	// Идентификация базы-клиента		
	КлиентХранилища			= Справочники.КлиентыХранилища.НайтиПоПользователю(ПараметрыСеанса.ТекущийПользователь);
	Если Не ЗначениеЗаполнено(КлиентХранилища) Тогда
		ДобавитьОшибку(Результат, "Клиент не зарегистрирован в хранилище файлов", Истина);
		Возврат Результат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(КлиентХранилища) Тогда
		
	// Поиск файла
	Файл = Справочники.Файлы.НайтиФайл(СтруктураПараметров.FileID, КлиентХранилища);
	Если Не ЗначениеЗаполнено(Файл) Тогда
		ДобавитьОшибку(Результат, "Файл отсутствует в хранилище", Истина);
		Возврат Результат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Файл) Тогда
	
	
	// Подготовка файла в ответу
	ДанныеФайла 	= РаботаСФайлами.ДанныеФайла(Файл);
	ДанныеСтрокой 	= СеарилизоватьДвоичныеДанные(ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла), Результат);
	Если ДанныеСтрокой = Неопределено Тогда
		Возврат Результат;
	КонецЕсли; // Если ДанныеСтрокой = Неопределено Тогда
		
	Результат.Вставить("Extension", ДанныеФайла.Расширение);
	Результат.Вставить("Data", 		ДанныеСтрокой);
	
	Возврат	Результат;
	
КонецФункции // GetFile

Функция PutFile(СтруктураПараметров) Экспорт
	
	Результат = Новый Структура("Отказ", Ложь);
	
	// FileID
	Если Не СтруктураПараметров.Свойство("FileID") Тогда
		ДобавитьОшибку(Результат, "Не указан параметр запроса [FileID]", Истина);
		Возврат Результат;
	КонецЕсли; // Если Не СтруктураПараметров.Свойство("FileID") Тогда	
	
	// Идентификация базы-клиента		
	КлиентХранилища = Справочники.КлиентыХранилища.НайтиПоПользователю(ПараметрыСеанса.ТекущийПользователь);
	Если Не ЗначениеЗаполнено(КлиентХранилища) Тогда
		ДобавитьОшибку(Результат, "Клиент не зарегистрирован в хранилище файлов", Истина);
		Возврат Результат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(КлиентХранилища) Тогда
	
	// Body		
	Если Не СтруктураПараметров.Свойство("body") Тогда
		ДобавитьОшибку(Результат, "Нет тела запроса", Истина);
		Возврат Результат;
	КонецЕсли; // Если Не СтруктураПараметров.Свойство("body") Тогда
		
	// Data	
	ТелоЗапроса = ПрочитатьСтрокуJSON(СтруктураПараметров.body);
	Если Не ТелоЗапроса.Свойство("Data") Тогда
		ДобавитьОшибку(Результат, "Нет данных для помещения в хранилище файлов", Истина);
		Возврат Результат;
	КонецЕсли; // Если Не ТелоЗапроса.Свойство("Data") Тогда
	
	// Двоичные данные из строки
	ДанныеЗапроса = ДесериализоватьДвоичныеДанные(ТелоЗапроса.Data, Результат); 
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат Результат;
	КонецЕсли; // ДанныеЗапроса = ДесериализоватьДвоичныеДанные(ТелоЗапроса.Data), Результат; 
	
	// BinaryData
	Если Не ДанныеЗапроса.Свойство("BinaryData") Тогда
		ДобавитьОшибку(Результат, "Нет двоичных данных", Истина);
		Возврат Результат;			
	КонецЕсли; // Если Не ТелоЗапроса.Свойство("BinaryData") Тогда
	
	// Extension 
	Если Не ТелоЗапроса.Свойство("Extension") Тогда
		ДобавитьОшибку(Результат, "Не указано расширение файла", Истина);
		Возврат Результат;			
	КонецЕсли; // Если Не ТелоЗапроса.Свойство("Extension") Тогда
					
	// Подготовка временного файла
	ПутьКФайлу = СохранитьВременныйФайл(ДанныеЗапроса.BinaryData, ТелоЗапроса.Extension, Результат);
	Если ПутьКФайлу = Неопределено Тогда
		Возврат Результат;			
	КонецЕсли; // Если ПутьКФайлу = Неопределено Тогда
	
	// Работа с данными файла
	Если Не ОбработатьПолученныйФайл(СтруктураПараметров, КлиентХранилища, ПутьКФайлу, Результат) Тогда
		Возврат Результат;
	КонецЕсли; // Если Не ОбработатьПолученныйФайл(СтруктураПараметров, КлиентХранилища, ПутьКФайлу, Результат) Тогда
	
	// Удаление временного файла
	УдалитьВременныйФайл(ПутьКФайлу, Результат);
	
	Возврат	Результат;
	
КонецФункции // PutFile
